linux/tar.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>tar, gzip, bzip2, zip, unzip 压缩解压</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="tar, gzip, bzip2, zip, unzip 压缩解压"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-04 08:47:46 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">
<a href="#" id="tabzilla" class="tabzilla-opened" role="button" aria-expanded="true" aria-controls="tabzilla-panel" title="Close (Esc)">No_Joking</a>
</div>

<div id="content">
<h1 class="title">tar, gzip, bzip2, zip, unzip 压缩解压</h1>


<link rel="stylesheet" type="text/css" href="../css/bootstrap.mozilla.css" />
<link rel="stylesheet" type="text/css" href="../css/tabzilla.css" />
<link rel="stylesheet" type="text/css" href="../css/vf.css" />
<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<script src="../js/tabzilla.js"></script>
<script src="../bootstrap/js/bootstrap.js"></script>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 tar</a>
<ul>
<li><a href="#sec-1-1">1.1 options</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 -f</a></li>
<li><a href="#sec-1-1-2">1.1.2 -v</a></li>
<li><a href="#sec-1-1-3">1.1.3 -c</a></li>
<li><a href="#sec-1-1-4">1.1.4 -t</a></li>
<li><a href="#sec-1-1-5">1.1.5 -x</a></li>
<li><a href="#sec-1-1-6">1.1.6 -r</a></li>
<li><a href="#sec-1-1-7">1.1.7 -A</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 解压指定文件</a></li>
</ul>
</li>
<li><a href="#sec-2">2 gzip, bzip2</a>
<ul>
<li><a href="#sec-2-1">2.1 gzip gunzip</a></li>
<li><a href="#sec-2-2">2.2 bzip2 bunzip2</a></li>
<li><a href="#sec-2-3">2.3 利用tar命令直接解压gz和bz2文件</a></li>
</ul>
</li>
<li><a href="#sec-3">3 zip</a>
<ul>
<li><a href="#sec-3-1">3.1 -@</a></li>
<li><a href="#sec-3-2">3.2 -r</a></li>
</ul>
</li>
<li><a href="#sec-4">4 unzip</a>
<ul>
<li><a href="#sec-4-1">4.1 -v</a></li>
<li><a href="#sec-4-2">4.2 -l</a></li>
<li><a href="#sec-4-3">4.3 -t</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> tar</h2>
<div class="outline-text-2" id="text-1">

<p>  tar只是对多个文件目录打包并没有压缩
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> options</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> -f</h4>
<div class="outline-text-4" id="text-1-1-1">




<pre class="example">--file = archive-name
-f archive-name
this option determines the name of the archive file that tar will work on.
指定要操作的tar文件
</pre>

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> -v</h4>
<div class="outline-text-4" id="text-1-1-2">




<pre class="example">   -verbose
   -v
   shows details about the results of running tar. This can be especially useful
when the results might not be obvious.
   显示tar运行的过程。为用户展现工作过程避免用户错误终止该程序。
</pre>

</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> -c</h4>
<div class="outline-text-4" id="text-1-1-3">




<pre class="example">-create
-c
create a new archive
</pre>

</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> -t</h4>
<div class="outline-text-4" id="text-1-1-4">




<pre class="example">--list
-t
显示archive file中的文件
tar -tf vf.tar
tar -tvf vf.tar 显示详细信息（ls -l)

</pre>

</div>

</div>

<div id="outline-container-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> -x</h4>
<div class="outline-text-4" id="text-1-1-5">




<pre class="example">--extract
-x
uncompress 解压缩。
tar -xvf vf.tar

</pre>

</div>

</div>

<div id="outline-container-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> -r</h4>
<div class="outline-text-4" id="text-1-1-6">




<pre class="example">--append
-r
向archive file中添加文件
tar -rf vf.tar exp.cpp       %将exp.cpp添加到vf.tar中
</pre>

</div>

</div>

<div id="outline-container-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> -A</h4>
<div class="outline-text-4" id="text-1-1-7">




<pre class="example">--concatenate
-A
将一个tar文件内容复制到另一个压缩文件中去。
tar -Af vf.tar a.tar         %将a.tar中内容拷贝到vf.tar中

</pre>

</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 解压指定文件</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="example">tar -xvf vf.tar               %将vf.tar解压到当前目录
tar -xvf vf.tar vf            %其中vf是vf.tar中的一个文件夹
tar -xvf vf.tar vf.cpp        %其中vf.cpp是vf.tar中的一个文件
tar -xvf vf.tar vf/vf/Debug   %只解压vf/vf/Debug
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> gzip, bzip2</h2>
<div class="outline-text-2" id="text-2">

<p>  gzip对文本文件进行压缩，后缀为gz
  bzip2比gzip有更高的压缩比率，后缀为bz2
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> gzip gunzip</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example">gzip vf.tar          %此时压缩vf.tar会变成vf.tar.gz
gunzip vf.tar.gz     %此时解压vf.tar.gz为vf.tar 等价于gzip -d vf.tar.gz
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> bzip2 bunzip2</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="example">bzip2 vf.tar         %此时压缩vf.tar生成vf.tar.bz2
bunzip2 vf.tar.bz2   %此时解压生成vf.tar 等价于bzip2 -d vf.tar.bz2
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 利用tar命令直接解压gz和bz2文件</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="example">tar -zxvf vf.tar.gz  %解压vf.tar.gz并拆包vf.tar
tar -jxvf vf.tar.bz2 解压vf.tar.bz2并拆包vf.tar
同理将上面的x变成c就可用来直接将打包并压缩生成相应的gz和bz2文件：
tar -zcvf vf.tar.gz vf1 vf2    %将vf1 vf2两个文件打包生成vf.tar并压缩生成vf.tar.gz
tar -jcvf vf.tar.bz2 vf1 vf2   %将vf1 vf2两个文件打包生成vf.tar并压缩生成vf.tar.bz2
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> zip</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> -@</h3>
<div class="outline-text-3" id="text-3-1">

<p>   find -maxdepth 1 -name "*.cpp" | zip source -@
   read names from stdin 
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> -r</h3>
<div class="outline-text-3" id="text-3-2">

<p>   添加文件
   zip -r vf vf.cpp 
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> unzip</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> -v</h3>
<div class="outline-text-3" id="text-4-1">

<p>   be verbose/print version info
   unzip -v vf.zip
   或者 unzip -v vf 自带识别zip文件
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> -l</h3>
<div class="outline-text-3" id="text-4-2">

<p>   list files (short format)
   查看内部文件
</p></div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> -t</h3>
<div class="outline-text-3" id="text-4-3">

<p>   test compressed archive data
   检查zip文件是否正常，有没有错误
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-04 08:47:46 CST</p>
<p class="author">Author: visaya fan</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>


</div>
</body>
</html>
